tutorials/precursorABL/GABLS1.stable/constant/ABLProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          ABLProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../0/include/initialConditions"

// Properties of the pressure gradient-driven wind
driveWindOn               true;
windInterpType           "cubic";
desiredWindTable
(
//   t         speed     direction
    (0.0       8.0       270.0)
    (100000.0  8.0       270.0)
);
hWind                     hWind [0 1 0 0 0 0 0] 400.0;
alpha                     0.9;

// Properties of the Coriolis force
planetaryRotationPeriod   24.0;
latitude                  73.0;

// Statistics gathering input
statisticsOn              true;
statisticsFrequency       1;


// ************************************************************************* //
