tutorials/precursorABL/GABLS1.stable/system/setFieldsABLDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          setFieldsABLDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../0/include/initialConditions"

// Extents of the domain (assumes x, y, and z start from 0.0).
xMin                        0.0;
yMin                        0.0;
zMin                        0.0;

xMax                      400.0;
yMax                      400.0;
zMax                      400.0;

zRef                      400.0;

// Specify if distance from wall should be used as z.
useWallDistZ              false;
scaleVelocityWithHeight   false;


// Specify how to initialze the base velocity and temperature profile.
velocityInitType          "table";
//velocityInitType          "log";
//velocityInitType          "geostrophic";
temperatureInitType       "table";
//temperatureInitType       "simple";

// Maximum perturbation of streamwise/spanwise flow near surface.
deltaU                    0.0;
deltaV                    0.0;

// Total periods of perturbations in streamwise/spanwise in the domain.
Uperiods                  4.0;
Vperiods                  4.0;

// Percentage of domain height (zMax) where peak in perturbation 
// magnitude occurs.
zPeak                     0.125;

// Initial height of the center of the capping inversion.
zInversion                100.0;

// Width of the capping inversion.
widthInversion            0.0;

// Potential temperature at the bottom and top of the capping inversion.
Tbottom                   $T0;
Ttop                      $T0;

// Maximum temperature fluctuation size below capping inversion.
TPrimeScale               0.1;

// Height rate of change of potential temperature above the inversion.
dTdz                      0.01;

// Geostrophic wind speed magnitude.
Ug                        8.0;

// Geostrophic wind speed direction.
UgDir                     270.0;

// Aerodynamic roughness height of surface.
z0                        0.1;

// von Karman constant.
kappa                     0.35;

// Vertical profile table.
profileTable
(
//   z          U       V        T
    (   6.25      3.32    0.00   265.0)
    (  18.75      4.42    0.00   265.0)
    (  31.25      5.16    0.00   265.0)
    (  43.75      5.77    0.00   265.0)
    (  56.25      6.30    0.00   265.0)
    (  68.75      6.74    0.00   265.0)
    (  81.25      7.11    0.00   265.0)
    (  93.75      7.42    0.00   265.0)
    ( 106.25      7.65    0.00   265.1)
    ( 118.75      7.82    0.00   265.2)
    ( 131.25      7.93    0.00   265.3)
    ( 143.75      7.99    0.00   265.4)
    ( 156.25      8.00    0.00   265.6)
    ( 168.75      8.00    0.00   265.7)
    ( 181.25      8.00    0.00   265.8)
    ( 193.75      8.00    0.00   265.9)
    ( 206.25      8.00    0.00   266.1)
    ( 218.75      8.00    0.00   266.2)
    ( 231.25      8.00    0.00   266.3)
    ( 243.75      8.00    0.00   266.4)
    ( 500.00      8.00    0.00   269.0)
);

// Update internal field.
updateInternalFields      true;

// Update boundary field.
updateBoundaryFields      true;

// ************************************************************************* //
